###############################################################################
# Created by write_sdc
# Mon Dec  5 18:28:38 2022
###############################################################################
current_design dffram_1rw1r_32_64
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name io_wbs_clk -period 50.0000 
set_clock_uncertainty 0.2500 io_wbs_clk
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[0]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[1]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[2]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[3]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[4]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr0[5]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[0]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[1]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[2]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[3]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[4]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {addr1[5]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {clk0}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {clk1}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {csb0}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {csb1}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[0]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[10]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[11]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[12]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[13]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[14]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[15]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[16]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[17]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[18]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[19]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[1]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[20]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[21]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[22]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[23]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[24]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[25]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[26]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[27]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[28]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[29]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[2]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[30]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[31]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[3]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[4]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[5]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[6]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[7]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[8]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {din0[9]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {web0}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {wmask0[0]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {wmask0[1]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {wmask0[2]}]
set_input_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {wmask0[3]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[0]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[10]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[11]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[12]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[13]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[14]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[15]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[16]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[17]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[18]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[19]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[1]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[20]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[21]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[22]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[23]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[24]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[25]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[26]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[27]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[28]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[29]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[2]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[30]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[31]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[3]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[4]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[5]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[6]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[7]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[8]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout0[9]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[0]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[10]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[11]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[12]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[13]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[14]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[15]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[16]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[17]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[18]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[19]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[1]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[20]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[21]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[22]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[23]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[24]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[25]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[26]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[27]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[28]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[29]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[2]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[30]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[31]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[3]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[4]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[5]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[6]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[7]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[8]}]
set_output_delay 10.0000 -clock [get_clocks {io_wbs_clk}] -add_delay [get_ports {dout1[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0729 [get_ports {dout0[31]}]
set_load -pin_load 0.0729 [get_ports {dout0[30]}]
set_load -pin_load 0.0729 [get_ports {dout0[29]}]
set_load -pin_load 0.0729 [get_ports {dout0[28]}]
set_load -pin_load 0.0729 [get_ports {dout0[27]}]
set_load -pin_load 0.0729 [get_ports {dout0[26]}]
set_load -pin_load 0.0729 [get_ports {dout0[25]}]
set_load -pin_load 0.0729 [get_ports {dout0[24]}]
set_load -pin_load 0.0729 [get_ports {dout0[23]}]
set_load -pin_load 0.0729 [get_ports {dout0[22]}]
set_load -pin_load 0.0729 [get_ports {dout0[21]}]
set_load -pin_load 0.0729 [get_ports {dout0[20]}]
set_load -pin_load 0.0729 [get_ports {dout0[19]}]
set_load -pin_load 0.0729 [get_ports {dout0[18]}]
set_load -pin_load 0.0729 [get_ports {dout0[17]}]
set_load -pin_load 0.0729 [get_ports {dout0[16]}]
set_load -pin_load 0.0729 [get_ports {dout0[15]}]
set_load -pin_load 0.0729 [get_ports {dout0[14]}]
set_load -pin_load 0.0729 [get_ports {dout0[13]}]
set_load -pin_load 0.0729 [get_ports {dout0[12]}]
set_load -pin_load 0.0729 [get_ports {dout0[11]}]
set_load -pin_load 0.0729 [get_ports {dout0[10]}]
set_load -pin_load 0.0729 [get_ports {dout0[9]}]
set_load -pin_load 0.0729 [get_ports {dout0[8]}]
set_load -pin_load 0.0729 [get_ports {dout0[7]}]
set_load -pin_load 0.0729 [get_ports {dout0[6]}]
set_load -pin_load 0.0729 [get_ports {dout0[5]}]
set_load -pin_load 0.0729 [get_ports {dout0[4]}]
set_load -pin_load 0.0729 [get_ports {dout0[3]}]
set_load -pin_load 0.0729 [get_ports {dout0[2]}]
set_load -pin_load 0.0729 [get_ports {dout0[1]}]
set_load -pin_load 0.0729 [get_ports {dout0[0]}]
set_load -pin_load 0.0729 [get_ports {dout1[31]}]
set_load -pin_load 0.0729 [get_ports {dout1[30]}]
set_load -pin_load 0.0729 [get_ports {dout1[29]}]
set_load -pin_load 0.0729 [get_ports {dout1[28]}]
set_load -pin_load 0.0729 [get_ports {dout1[27]}]
set_load -pin_load 0.0729 [get_ports {dout1[26]}]
set_load -pin_load 0.0729 [get_ports {dout1[25]}]
set_load -pin_load 0.0729 [get_ports {dout1[24]}]
set_load -pin_load 0.0729 [get_ports {dout1[23]}]
set_load -pin_load 0.0729 [get_ports {dout1[22]}]
set_load -pin_load 0.0729 [get_ports {dout1[21]}]
set_load -pin_load 0.0729 [get_ports {dout1[20]}]
set_load -pin_load 0.0729 [get_ports {dout1[19]}]
set_load -pin_load 0.0729 [get_ports {dout1[18]}]
set_load -pin_load 0.0729 [get_ports {dout1[17]}]
set_load -pin_load 0.0729 [get_ports {dout1[16]}]
set_load -pin_load 0.0729 [get_ports {dout1[15]}]
set_load -pin_load 0.0729 [get_ports {dout1[14]}]
set_load -pin_load 0.0729 [get_ports {dout1[13]}]
set_load -pin_load 0.0729 [get_ports {dout1[12]}]
set_load -pin_load 0.0729 [get_ports {dout1[11]}]
set_load -pin_load 0.0729 [get_ports {dout1[10]}]
set_load -pin_load 0.0729 [get_ports {dout1[9]}]
set_load -pin_load 0.0729 [get_ports {dout1[8]}]
set_load -pin_load 0.0729 [get_ports {dout1[7]}]
set_load -pin_load 0.0729 [get_ports {dout1[6]}]
set_load -pin_load 0.0729 [get_ports {dout1[5]}]
set_load -pin_load 0.0729 [get_ports {dout1[4]}]
set_load -pin_load 0.0729 [get_ports {dout1[3]}]
set_load -pin_load 0.0729 [get_ports {dout1[2]}]
set_load -pin_load 0.0729 [get_ports {dout1[1]}]
set_load -pin_load 0.0729 [get_ports {dout1[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk0}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk1}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {csb0}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {csb1}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {web0}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr1[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[31]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[30]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[29]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[28]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[27]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[26]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[25]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[24]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[23]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[22]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[21]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[20]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[19]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[18]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[17]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[16]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[15]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[14]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[13]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[12]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[11]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[10]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[9]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[8]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[7]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[6]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[5]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[4]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[0]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[3]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[2]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[1]}]
set_driving_cell -lib_cell gf180mcu_fd_sc_mcu7t5v0__inv_1 -pin {ZN} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 4.0000 [current_design]
